# Листинг 3.2
# Положительное вещественное число
float_num_1 = 123.45
print('Положительное вещественное число:', float_num_1)

# Отрицательное вещественное число
float_num_2 = -123.45
print('Отрицательное вещественное число:', float_num_2)

# Отрицательное с пропущенным нулем
float_num_3 = -.45
print('Отрицательное с пропущенным нулем (-.45):', float_num_3)

# 1.2345e8 в экспоненциальной форме
float_num_4 = 1.2345e8
print('1.2345e8 в экспоненциальной форме это:', float_num_4)

# 1.2345E-4 в экспоненциальной форме
float_num_5 = 1.2345E-4
print('1.2345E-4 в экспоненциальной форме это:', float_num_5)