# Словарь для хранения текста
klad = {'Ключ1': 'Золото', 'Ключ2': 'Серебро',
        'Ключ3': 'Жемчуг', 'Ключ4': 'Золото'}
print('Пираты спрятали клад и мешочек с ключами:')
print(klad)
print('-' * 70)

print('А мы нашли клад и открыли сундуки:')
# Открываем первый сундук
sunduk_1 = klad['Ключ1']
print('Открыли первый сундук ->', sunduk_1)

# Открываем второй сундук
sunduk_2 = klad['Ключ2']
print('Открыли второй сундук ->', sunduk_2)

# Открываем третий сундук
sunduk_3 = klad['Ключ3']
print('Открыли третий сундук ->', sunduk_3)

# Открываем четвертый сундук
sunduk_4 = klad['Ключ4']
print('Открыли четвертый сундук ->', sunduk_4)