# Листинг 14.3
print('Строка - Однажды в студеную зимнюю пору...')
print('Число -', 135.8)
print('Список -', ['Лимон', 'Мандарин', 3.14])
print('Картеж -', ('Лимон', 'Мандарин', 3.14))
print('Функция -', int(555.33), str('999'))
print('Разделитель ":"-', 1, 2, 3, sep=" : ")

# Задает дополнительный пропуск одной строки
print(111, 111, 111, end="\n\n")

# Отменить перевод на новую строку
print(222, 222, 222, end="")
print(' Один ', ' Два ', ' Три ')

print()  # Печать пустой строки
print('Эта строка после пустой')