import streamlit as st

def run_9_1():
    st.markdown('#### 🐍 Урок 9.1. Логические операторы сравнения')
    st.markdown('##### Логические операторы сравнения чисел')
    st.write('Начальные значения переменным x и y')
    x = 10
    y = 20
    st.write('x =', x, 'y =', y)
    st.write('Сравниваем числа')
    st.write('x == 10 ->', x == 10)
    st.write('x != 10 ->', x != 10)
    st.write('x > y ->', x > y)
    st.write('x < y ->', x < y)
    st.write('x >= 10 ->', x >= 10)
    st.write('y <= 20 ->', y <= 20)
    st.write('True = 1 ->', True == 1)
    st.write('False = 0 ->', False == 0)
    st.write('🎥 Смотрите мультфильм: про сравнение чисел')

def run_9_2():
    st.markdown('#### 🐍 Урок 9. 2. Логические выражения')
    st.markdown('##### Логические выражения из нескольких операторов')
    st.write('Начальные значения переменным x и y')
    print('Начальные значения переменным x и y')
    x = 10
    y = 20
    st.write('x =', x, 'y =', y)
    z = (x == 10 and y == 20)
    st.write('(x == 10 and y == 20) ->', z)
    z = (x == 10 and y == 10)
    st.write('(x == 10 and y == 10) ->', z)
    z = (x == 10 or y == 10)
    st.write('(x == 10 or y == 10) ->', z)
    z = (x == 20 or y == 30)
    st.write('(x == 20 or y == 30) ->', z)
    z = (x == 10)
    st.write('(x == 10) ->', z)
    z = (not x == 10)
    st.write('(not x == 10) ->', z)
    st.write('🎥 Смотрите мультфильм: про программиста')

def run_9_3():
    st.markdown('#### 🐍 Урок 9.3. Тип данных None (пусто) ')
    st.markdown('##### Резервирование памяти для данных')
    n = None
    st.write('Пустое значение (ничего) ->', n)
    st.write('В переменной n пусто? (n is None) ->', n is None)
    st.write('-' * 30)
    n = [1, 2, 3, 4]
    st.text('В переменной n лежит список -> ' + str(n))
    n = (1, 2, 3, 4)
    st.write('В переменной n лежит кортеж ->', n)
    n = {1, 2, 3, 4}
    st.write('В переменной n лежит множество ->', n)
    st.write('В переменной n пусто? (n is None) ->', n is None)
    st.write('🎥 Смотрите мультфильм: про пустое место')

if __name__ == '__main__':
    run_9_1()