import streamlit as st

def run_16_1():
    st.markdown('#### 🐍 Урок 16.3. Наш первый класс «Автомобиль»')
    st.markdown('##### Класс - это наиболее универсальный модуль Python')
    class Car:
        """Автор программы ПиТолик"""
        class_obj = "Автомобили"  # Объекты класса
        max_speed = 90  # Максимально допустимая скорость на дорогах
        def __init__(self, brand='Ford', weight=900, power=150, colour='Красный'):
            self.brand = brand  # Марка, модель автомобиля
            self.weight = weight  # Вес автомобиля
            self.power = power  # Мощность двигателя
            self.colour = colour  # Мощность двигателя
            self.signal = 'Би-Бип'  # Имитация звука сигнала
        def drive(self):  # Метод двигаться прямо
            st.write("Поехали, двигаемся прямо!")
            st.write("Скорость движения не более -", Car.max_speed)
        def righ(self):  # Метод повернуть на право
            st.write("Едем, поворачиваем руль направо!")
        def left(self):  # Метод повернуть на лево
            st.write("Едем, поворачиваем руль налево!")
        def brake(self):  # Метод тормозить
            st.write("Стоп, активируем тормоз")
        def beep(self):  # Метод подать звуковой сигналь
            st.write("Подан звуковой сигнал")
            st.write(self.signal)
    st.write('--- Выводим сведения о классе Car ---')
    st.write('Объекты класса->', Car.class_obj)
    st.write(Car.__doc__)
    st.write('-' * 55)
    st.write('Создаем объект MyCar_1 (значения свойств по умолчанию)')
    MyCar_1 = Car()
    st.write('Сведения об объекте MyCar_1 (значения свойств по умолчанию)')
    st.write('Бренд->', MyCar_1.brand)
    st.write('Вес->', MyCar_1.weight, 'кг.')
    st.write('Мощность->', MyCar_1.power, 'лс.')
    st.write('Цвет->', MyCar_1.colour)
    st.write('-' * 55)
    st.write('Создаем объект MyCar_2 и меняем значения свойств')
    MyCar_2 = Car('Мерседес', 1200, 250, 'Черный')
    st.write('Сведения об объекте MyCar_2 (с новыми свойствами)')
    st.write('Бренд->', MyCar_2.brand)
    st.write('Вес->', MyCar_2.weight, 'кг.')
    st.write('Мощность->', MyCar_2.power, 'лс.')
    st.write('Цвет->', MyCar_2.colour)
    st.write('🎥 Смотрите фильм: про классы')

def run_16_2():
    st.markdown('#### 🐍 Урок 16.4. Управляем автомобилями через методы класса')
    st.markdown('##### Методы класса - это замена функций Python')
    class Car:
        """Автор программы ПиТолик"""
        class_obj = "Автомобили"  # Объекты класса
        max_speed = 90  # Максимально допустимая скорость на дорогах
        def __init__(self, brand='Ford', weight=900, power=150, colour='Красный'):
            self.brand = brand  # Марка, модель автомобиля
            self.weight = weight  # Вес автомобиля
            self.power = power  # Мощность двигателя
            self.colour = colour  # Мощность двигателя
            self.signal = 'Би-Бип'  # Имитация звука сигнала
        def drive(self):  # Метод двигаться прямо
            st.write("Поехали, двигаемся прямо!")
            st.write("Скорость движения не более -", Car.max_speed)
        def righ(self):  # Метод повернуть на право
            st.write("Едем, поворачиваем руль направо!")
        def left(self):  # Метод повернуть на лево
            st.write("Едем, поворачиваем руль налево!")
        def brake(self):  # Метод тормозить
            st.write("Стоп, активируем тормоз")
        def beep(self):  # Метод подать звуковой сигналь
            st.write("Подан звуковой сигнал")
            st.write(self.signal)
    def drive_car(MyCar):
        st.write('----- Поехал автомобиль', MyCar.brand, '-----')
        MyCar.drive()  # Двигается прямо
        MyCar.righ()  # Поворачиваем направо
        MyCar.drive()  # Двигается прямо
        MyCar.left()  # Поворачиваем налево
        MyCar.drive()  # Двигается прямо
        MyCar.beep()  # Подаем звуковой сигнал
        MyCar.brake()  # Тормозим
        st.write('-' * 50)
        return
    MyCar_1 = Car()
    st.write('Создан автомобиль', MyCar_1.brand, 'цвет-', MyCar_1.colour)
    drive_car(MyCar_1)
    MyCar_2 = Car('Мерседес', 1200, 250, 'Черный')
    st.write('Создан автомобиль', MyCar_2.brand, 'цвет-', MyCar_2.colour)
    drive_car(MyCar_2)
    st.write('🎥 Смотрите фильм: про классы')

if __name__ == '__main__':
    run_16_1()