import streamlit as st

def run_3_1():
    st.markdown('#### 🐍 Урок 3.1. Целые числа')
    st.markdown('##### Десятичные целые числа')
    int_1 = 15
    st.write('int_1 = ', int_1)
    int_2 = -2
    st.write('int_2 = ', int_2)
    r = int_1 + int_2
    st.write('Сложение r = ', r)
    r = int_1 - int_2
    st.write('Вычитание r = ', r)
    r = int_1 * 2
    st.write('Умножение r = ', r)
    r = int_1 / 2
    st.write('Деление r = ', r)
    st.write('🎥 Смотрите мультфильм - учимся считать')

def run_3_2():
    st.markdown('#### 🐍 Урок 3.2. Вещественные числа')
    st.markdown('##### Числа с дробной частью')
    float_num_1 = 123.45
    st.write('Положительное вещественное число:', float_num_1)
    float_num_2 = -123.45
    st.write('Отрицательное вещественное число:', float_num_2)
    float_num_3 = -.45
    st.write('Отрицательное с пропущенным нулем (-.45):', float_num_3)
    float_num_4 = 1.2345e8
    st.write('1.2345e8 в экспоненциальной форме это:', float_num_4)
    float_num_5 = 1.2345E-4
    st.write('1.2345E-4 в экспоненциальной форме это:', float_num_5)
    st.write('🎥 Смотрите урок - про степень числа')

def run_3_3():
    st.markdown('#### 🐍 Урок 3.3. Вещественные числа')
    st.markdown('##### Арифметические операции')
    x = 10.5
    y = 2.2
    st.write('Даны числа x = ', x, ' y = ', y)
    z = x + y
    st.write('Сложение:', z)
    z = x - y
    st.write('Вычитание:', z)
    z = x * y
    st.write('Умножение:', z)
    z = x / y
    st.write('Деление:', z)
    z = x ** y
    st.write('Возведение в степень:', z)
    st.write('🎥 Смотрите мультфильм - учимся считать')

def run_3_4():
    st.markdown('#### 🐍 Урок 3.3. Вещественные числа')
    st.markdown('##### Округление чисел')
    x = 10.5
    y = 2.2
    st.write('Даны числа x = ', x, ' y = ', y)
    z = round((x / y), 2)
    st.write('Деление: ', z)
    z = round((x ** y), 2)
    st.write('Возведение в степень: ', z)
    st.write('🎥 Смотрите мультфильм - про округление чисел')

def run_3_5():
    st.markdown('#### 🐍 Урок 3.3. Вещественные числа')
    st.markdown('##### Функции обработки чисел')
    x = 10.5
    y = -10.5
    st.write('Даны числа x = ', x, ' y = ', y)
    z = abs(-y)
    st.write('Получение абсолютного значения: ', z)
    z = eval('x - y')
    st.write('Преобразование строки в выражение: ', z)
    z = int(x)
    st.write('Преобразование в целое: ', z)
    x = '25.3'
    z = float(x)
    st.write('Преобразование в вещественное: ', z)
    Maksim = 148
    Vova = 150
    Vika = 140
    Sveta = 145
    z = max(Maksim, Vova, Vika, Sveta)
    st.write('Самый высокий: ', z)
    z = min(Maksim, Vova, Vika, Sveta)
    st.write('Самый маленький: ', z)
    list_deti = (Maksim, Vova, Vika, Sveta)
    st.text('Строимся по росту: ' + str(sorted(list_deti)))

def run_3_6():
    st.markdown('#### 🐍 Урок 3.4. Математические выражения')
    st.markdown('##### Скобки в математических выражениях')
    a = 10
    b = 20
    c = 2
    st.write('Даны числа a = ', a, ' b = ', b, ' c = ', c)
    d = a + b + c + a * c + b / 2 + c ** 2 - c
    st.write('Вычисление без скобок d = ', d)
    d = a + b + c + a * c + b / (2 + c ** 2 - c)
    st.write('Вычисление со скобками d = ', d)

def run_3_7():
    st.markdown('#### 🐍 Урок 3.5. Сравнение чисел между собой')
    st.markdown('##### Операции сравнения чисел')
    Gena = 160  # Это рост крокодила Гены
    Cheburaska = 40  # Это рост Чебурашки
    Shapoklak = 160  # Это рост старухи Шапокляк
    st.write('Гена и Шапокляк одного роста: ', Gena == Shapoklak)
    st.write('Гена и Чебурашка одного роста: ', Gena == Cheburaska)
    st.write('Гена выше Чебурашки: ', Gena > Cheburaska)
    st.write('Гена ниже Чебурашки: ', Gena < Cheburaska)
    st.write('Гена и Шапокляк разного роста: ', Gena != Shapoklak)
    st.write('Гена и Чебурашка разного роста: ', Gena != Cheburaska)
    st.write('🎥 Смотрите мультфильм - про Чебурашку')

def run_3_8():
    st.markdown('#### 🐍 Урок 3.6. Комбинированные операторы присваивания')
    st.markdown('##### Варианты комбинированного присваивания')
    a = 4
    st.write('Простое присваивание (=): ', a)
    a += 1
    st.write('Сложение и присваивание (+=): ', a)
    a -= 1
    st.write('Вычитание и присваивание (-=) ', a)
    a /= 2
    st.write('Деление и присваивание (/=) ', a)
    a *= 2
    st.write('Умножение и присваивание (*=) ', a)
    a **= 2
    st.write('Возведение в степень и присваивание (**=) ', a)
    st.write('🎥 Смотрите мультфильм - про лень')

def run_3_9():
    st.markdown('#### 🐍 Урок 3.7. Специальные математические функции')
    st.markdown('##### Использование математических функций')
    import math
    st.write('Число pi =', math.pi)
    st.write('Число tau =', math.tau)
    st.write('Число e =', math.e)
    st.write('Положительная бесконечность:', math.inf)
    a = (1, 2, 3, 4, 5.5)
    st.write('Сумма последовательности чисел =', math.fsum(a))
    st.write('Экспонента =', math.exp(10.5))
    st.write('Натуральный логарифм =', math.log1p(10.5))
    st.write('Десятичный логарифм =', math.log10(10.5))
    st.write('Возведение в степень =', math.pow(10, 2.5))
    st.write('Квадратный корень =', math.sqrt(100))
    z = math.radians(30)  # перевод градусов в радианы
    st.write('Синус 30 град. =', math.sin(z))
    st.write('Косинус 30 град. =', math.cos(z))
    st.write('Тангенс 30 град. =', math.tan(z))

def run_3_10():
    st.markdown('#### 🐍 Урок 3.8. Точность вычислений с модулем decimal')
    st.markdown('##### Задаем точность вычислений')
    from decimal import Decimal
    a = 0.1
    st.write('Дано число a=', a)
    b = a + a + a
    st.write('Итог с точностью по умолчанию b=', b)
    a = Decimal('0.1')
    b = a + a + a
    st.write('Итог с заданной точностью b=', b)

def run_3_11():
    st.markdown('#### 🐍 Урок 3.9. Дроби и модуль fractions')
    st.markdown('##### Операции с дробями')
    from fractions import Fraction
    # Кусочек торта разделили на 3 пирожных
    pirog = Fraction('1/3')
    st.write('Одно пирожное это - ', pirog, ' часть торта')
    # 3 пирожных сложили вместе
    st.write('Сложили 3 пирожных и получили - ',
          pirog + pirog + pirog, ' торт')
    # Наполнили стакан водой на половину
    pol_stak = Fraction('1/2')
    st.write('Полстакана в виде дроби: ', pol_stak)
    st.write('Полстакана десятичном виде: ', 1 / 2)
    st.text('---------------------------------')
    # Сумма дробей в виде числа с плавающей точкой
    st.write('Это дроби в десятичном виде')
    a = 1 / 3
    b = 1 / 2
    st.write('a = ', a, ' b= ', b)
    st.write('Сумма дробей в виде десятичного числа= ', a + b)
    st.text('---------------------------------')
    # Сумма дробей в виде дроби
    st.write('Это дроби в виде дроби ')
    a = Fraction('1/3')
    b = Fraction('1/2')
    st.write('a= ', a, ' b =' , b)
    st.write('Сумма дробей в виде дроби: ', a + b)
    st.write('🎥 Смотрите урок - про дроби')

if __name__ == '__main__':
    run_3_1()