import streamlit as st

def run_15_1():
    st.markdown('#### 🐍 Урок 15.1. Аргументы и параметры функций')
    st.markdown('##### Функция может принимать разные параметры')
    def my_func(x=20, y=10):
        rez = x - y
        return rez
    res_1 = my_func()
    st.write('Аргументы не заданы: res_1 =', res_1)
    res_2 = my_func(40)
    st.write('Передан 1 аргумент (20): res_2 =', res_2)
    res_3 = my_func(200, 100)
    st.write('Передано 2 аргумента (200, 100): res_3 =', res_3)
    res_4 = my_func(x=100, y=500)
    st.write('Переданы именованные аргументы (x=100, y=500): res_4 =', res_4)
    res_5 = my_func(y=500, x=100)
    st.write('Переданы именованные аргументы (y=500, x=100): res_5 =', res_5)
    st.write('🎥 Смотрите мультфильм: про функцию')

def run_15_2():
    st.markdown('#### 🐍 Урок 15.2. Решаем задачу с паромом с помощью функции')
    st.markdown('##### Функция позволяет сократить программный код')
    list_passagir = ["Козленок", "Теленок", "Корова",
                     "Бык", "Конь", "Свинья", "Кот",
                     "Пес", "Баран", "Гусь", "Индюк",
                     "Курица", "Волк", "Лиса", "Медведь"]
    # Создаем функцию
    def poexali(n_1, n_2):
        parom = []  # Пустой паром
        for i in range(n_1, n_2):
            # на паром сел один пассажир
            parom.append(list_passagir[i])
        return parom
    st.text('Утренние рейсы')
    st.text('Рейс 1: ' + str(poexali(0, 10)))
    st.text('Рейс 2: ' + str(poexali(10, 15)))
    st.text('Вечерние рейсы')
    st.text('Рейс 3: ' + str(poexali(0, 10)))
    st.text('Рейс 4: ' + str(poexali(10, 15)))
    st.write('🎥 Смотрите мультфильм: про козленка')

def run_15_3():
    st.markdown('#### 🐍 Урок 15.3. Однострочные функции')
    st.markdown('##### Короткий код функции может иметь всего одну строку')
    def my_func(a, b, c): return a + b + c
    x, y, z = 1, 2, 3
    st.write('Аргументы числа, rez1 = ', my_func(x, y, z))
    x = ['Иванов ', 'Семен ', 'Петрович']
    rez2 = my_func(x[0], x[1], x[2])
    st.write('Аргументы символы, rez2 = ', rez2)

if __name__ == '__main__':
    run_15_1()