import streamlit as st

def run_6_1():
    st.markdown('#### 🐍 Урок 6.1. Создание кортежей в Python')
    st.markdown('##### Элементы кортежа нельзя изменить!')
    str_0 = 'Дама сдавала в багаж'
    str_1 = 'Диван,'
    str_2 = 'Чемодан, '
    str_3 = 'Саквояж,'
    str_4 = 'Картину,'
    str_5 = 'Корзину, '
    str_6 = 'Картонку'
    str_7 = 'И маленькую собачонку.'
    # Создаем кортеж
    bagag = (str_0, str_1, str_2, str_3, str_4, str_5, str_6, str_7)
    st.text(bagag[0])
    st.text(bagag[1])
    st.text(bagag[2])
    st.text(bagag[3])
    st.text(bagag[4])
    st.text(bagag[5])
    st.text(bagag[6])
    st.text(bagag[7])
    st.text('-' * 30)
    st.text('Поезд приехал на станцию "Дно"')
    st.text('И там заменили место одно')
    st.text('Решили грузчики так пошутить - ')
    str_7 = 'Лохматого пса в багаж посадить'
    st.text(str_7)
    st.text('-' * 30)
    # Получение багажа
    st.text('Но получила дама багаж')
    st.text(bagag[1])
    st.text(bagag[2])
    st.text(bagag[3])
    st.text(bagag[4])
    st.text(bagag[5])
    st.text(bagag[6])
    st.text(bagag[7])
    st.write('🎥 Смотрите мультфильм: про багаж')

def run_6_2():
    st.markdown('#### 🐍 Урок 6.2. Доступ к элементам кортежей по индексу и срезу')
    st.markdown('##### Поиск и выборки элементов кортежа')
    kolobok = ("Дедушка", "Бабушка", "Заяц", "Волк",
               "Медведь", "Лиса")
    st.text('-----Элементы кортежа-----------')
    st.text(kolobok)
    st.text('-' * 57)
    st.text('Первый элемент кортеж по индексу 0')
    st.text('Герой №1 -> ' + str(kolobok[0]))
    st.text('-' * 30)
    st.text('Второй элемент кортежа по индексу 1')
    st.text('Герой №2 -> ' + str(kolobok[1]))
    st.text('-' * 30)
    st.text('Последний элемент кортежа по индексу -1')
    st.text('Герой №6 -> ' + str(kolobok[-1]))
    st.text('-' * 30)
    st.text('Предпоследний элемент кортежа по индексу -2')
    st.text('Герой №5 -> ' + str(kolobok[-2]))
    st.text('-' * 30)
    st.text('Герои по индексу 2-4')
    st.text('Герой №3 и №4 -> ' + str(kolobok[2:4]))
    st.write('🎥 Смотрите мультфильм: Колобок')

def run_6_3():
    st.markdown('#### 🐍 Урок 6.3. Операторы и инструкции для обработки кортежей')
    st.markdown('##### Арифметические операции с кортежами')
    tuple_1 = (1, 2, 3)
    tuple_2 = (4, 5, 6)
    tuple_3 = ('Хрюша', 'Кирюша', 'Степаша')
    st.text('Сформированы следующие кортежи:')
    st.text('tuple_1: ' + str(tuple_1))
    st.text('tuple_2: ' + str(tuple_2))
    st.text('tuple_3: ' + str(tuple_3))
    st.text('-' * 30)
    tuple_4 = tuple_1 + tuple_2
    st.text('Объединение кортежей tuple_1 + list_2  -> ' + str(tuple_4))
    tuple_1 += tuple_3
    st.text('Объединение кортежей (tuple_1 += tuple_3) -> ' + str(tuple_1))
    tuple_1 = (1, 2, 3)
    st.text('Умножение кортежей (tuple_1*3) -> ' + str(tuple_1 * 3))
    p1 = 'Степаша' in tuple_3
    st.text('Степаша найден-> ' + str(p1))
    p1 = 'Гоша' in tuple_3
    st.text('Гоша найден -> ' + str(p1))
    st.write('🎥 Смотрите мультфильм: Кортеж - на примере автомобилей')

def run_6_4():
    st.markdown('#### 🐍 Урок 6.4. Функции и методы обработки кортежей')
    st.markdown('##### Обрабатываем кортежи встроенными функциями')
    tpl = (0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 9, 8)
    # Исходные кортежи
    st.text('Сформирован следующий кортеж:')
    st.text('tpl_1 -> ' + str(tpl))
    st.text('-' * 30)
    n_1 = tpl.count(9)
    st.text('Количество чисел 9 -> ' + str(n_1))
    tpl_len = len(tpl)
    st.text('Количество элементов в кортеже -> ' + str(tpl_len))
    tpl_min = min(tpl)
    st.text('Минимальное значение элемента кортежа -> ' + str(tpl_min))
    tpl_max = max(tpl)
    st.text('Максимальное значение элемента кортежа -> ' + str(tpl_max))
    tpl_sum = sum(tpl)
    st.text('Сумма значений элементов кортежа -> ' + str(tpl_sum))

def run_6_5():
    st.markdown('#### 🐍 Урок 6.5. Отличие кортежей от списков')
    st.markdown('##### Кортежи занимают меньше памяти, чем списки')
    import sys
    list_1 = [100, 200, 300, 400, 500, 600, 700, 800, 900]
    tpl_1 = (100, 200, 300, 400, 500, 600, 700, 800, 900)
    st.text('Размер list_1-> ' + str(sys.getsizeof(list_1)))
    st.text('Размер tpl_1-> ' + str(sys.getsizeof(tpl_1)))
    st.write('🎥 Смотрите мультфильм: про память компьютера')

if __name__ == '__main__':
    run_6_1()