import streamlit as st

def run_14_1():
    st.markdown('#### 🐍 Урок 14.1. Функция open() для работы с файлами')
    st.markdown('##### Эта функция позволяет открыть файл для чтения данных')
    text = 'У лукоморья дуб зелёный;\n' \
           'Златая цепь на дубе том:\n' \
           'И днём и ночью кот учёный\n' \
           'Всё ходит по цепи кругом;'
    file_txt = open('my_file.txt', 'w')
    file_txt.write(text)
    file_txt.close()
    # Прочитать информацию из файла
    with open('my_file.txt', 'r') as file_txt:
        data_text = file_txt.read()
    # Вывести содержимое файл
    for line in data_text.splitlines():
        st.text(line)

def run_14_2():
    st.markdown('#### 🐍 Урок 14.2. Функция input() для ввода данных и инструкция «try: except»')
    st.markdown('##### Функция input() позволяет водить данные с клавиатуры')

    text_1 = None
    text_1 = st.text_input('Ведите любой текст:')
    if text_1:
        st.write('Пользователь ввел текст ->', text_1)
        st.text('Тип объекта text_1:' + str(type(text_1)))
        st.write('-' * 30)

    # Целое число
    num_1 = st.number_input('Ведите любое целое число:', value=1)
    if num_1:
        st.write('Пользователь ввел строку ->', num_1)
        st.text('Тип объекта num_1 после ввода:' + str(type(num_1)))
        try:
            num_1 = int(num_1)
            st.text('num_1 после преобразования в число:' + str(num_1) + str(type(num_1)))
        except ValueError:
            st.write("Это не число! Введен недопустимый символ!")
        st.write('-' * 30)

    # Вещественное число
    num_2 = st.number_input('Ведите любое число с десятичной точкой:', value=1.1)
    if num_2:
        try:
            st.text('Пользователь ввел строку ->' + str(num_2))
            num_2 = float(num_2)
            st.text('num_2 после преобразования в число:' + str(num_2) + str(type(num_2)))
        except ValueError:
            st.write('Это не число! Введен недопустимый символ!')

def run_14_3():
    st.markdown('#### 🐍 УУрок 14.3.Функция print() для вывода данных')
    st.markdown('##### Функция print() позволяет выводить данные')
    st.write('Строка - Однажды в студеную зимнюю пору...')
    st.write('Число -', 135.8)
    st.text('Список -' + str(['Лимон', 'Мандарин', 3.14]))
    st.write('Картеж -', ('Лимон', 'Мандарин', 3.14))
    st.write('Функция -', int(555.33), str('999'))
    st.text('Разделитель ":"-' + ': 1 ' + ': 2 ' + ': 3')
    # Задает дополнительный пропуск одной строки
    st.write(111, 111, 111)
    # Отменить перевод на новую строку
    st.write(222, 222, 222, ' Один ', ' Два ', ' Три ')
    st.write('')  # Печать пустой строки
    st.write('Эта строка после пустой')

if __name__ == '__main__':
    run_14_1()