import streamlit as st

def run_12_1():
    st.markdown('#### 🐍 Урок 12.1. Простейшая форма инструкции if')
    st.markdown('##### Выполнение фрагмента программы по условию')
    doroga_rovno = 'Ровная дорога'
    doroga_yama = 'Яма на дороге'
    tormoz = 'Нужно сбавить скорость и объехать яму'
    rovno = 'Дорога ровная, можно ехать вперед'
    st.write(rovno)
    doroga = rovno
    if doroga == doroga_yama:
        st.write(tormoz)
        doroga = rovno
    st.write(rovno)
    st.write('-' * 30)
    st.write(rovno)
    doroga = doroga_yama
    if doroga == doroga_yama:
        st.write(tormoz)
        doroga = rovno
    st.write(rovno)

def run_12_2():
    st.markdown('#### 🐍 Урок 12.2. Управляющая инструкция if/else')
    st.markdown('##### Разветвление в программе на две ветки')
    red_signal = 'Красный'
    green_signal = 'Зеленый'
    stop = 'Стоять и ждать зеленого сигнала'
    start = 'Переходить дорогу'
    svetofor = red_signal
    if svetofor == red_signal:
        st.write('Сигнал светофора -', svetofor)
        st.write(stop)
    else:
        st.write('Сигнал светофора -', svetofor)
        st.write(start)
    st.write('-' * 30)
    svetofor = green_signal
    if svetofor == red_signal:
        st.write('Сигнал светофора -', svetofor)
        st.write(stop)
    else:
        st.write('Сигнал светофора -', svetofor)
        st.write(start)
    st.write('🎥 Смотрите мультфильм: про светофор')

def run_12_3():
    st.markdown('#### 🐍 Урок 12.3. Управляющая инструкция if/elif/else')
    st.markdown('##### Разветвление в программе на множество веток')
    brat_1 = 'Старший брат'
    brat_2 = 'Средний брат'
    brat_3 = 'Младший брат'
    # Дворы
    dvor_1 = 'Боярский двор'
    dvor_2 = 'Купеческий двор'
    dvor_3 = 'Болото топкое'
    # Кто выпустил стрелу
    strela = brat_1
    # strela = brat_2
    # strela = brat_3
    if strela == brat_1:
        st.write('Выпустил стрелу - ', strela)
        st.write('Упала стрела на - ', dvor_1)
    elif strela == brat_2:
        st.write('Выпустил стрелу - ', strela)
        st.write('Упала стрела на - ', dvor_2)
    else:
        st.write('Выпустил стрелу - ', strela)
        st.write('Упала стрела на - ', dvor_3)
    st.write('🎥 Смотрите мультфильм: "Царевна-лягушка"')

def run_12_4():
    st.markdown('#### 🐍 Урок 12.4. Однострочное выражение if/else')
    st.markdown('##### Разветвление в программе одной строкой')
    x = 15
    y = 10
    # Обычная инструкция if/else
    if x > y:
        s = x + y
    else:
        s = x - y
    st.write('Обычная инструкция if/else: s=', s)
    # Однострочное (трехместное) выражение
    s = x + y if x > y else x - y
    st.write('Однострочное выражение if/else: s=', s)
    # Однострочное (трехместное) выражение в составе другой инструкции
    s = x + (x + y if x > y else x - y) + y ** 2
    st.write('Однострочное выражение if/else в составе другой инструкции')
    st.write('s =', s)
    st.write('🎥 Смотрите мультфильм: про клавиатуру')

if __name__ == '__main__':
    run_12_1()