import streamlit as st

def run_11_1():
    st.markdown('#### 🐍 Урок 10.1. Инструкции в Python')
    st.markdown('##### Инструкция - это последовательность действий')
    Misha = "У меня есть велосипед"
    Sasha = "У меня есть велосипед"
    Masha = "У меня есть велосипед"
    st.write('Миша - ', Misha)
    st.write('Саша - ', Sasha)
    st.write('Маша - ', Masha)
    st.write('-' * 40)
    Misha = Sasha = Masha = "У меня есть велосипед"
    st.write('Миша - ', Misha)
    st.write('Саша - ', Sasha)
    st.write('Маша - ', Masha)
    st.write('=' * 40)
    Egor = "У меня есть скейтборд"
    Artem = "У меня есть велосипед"
    Sveta = "У меня есть самокат"
    st.write('Егор - ', Egor)
    st.write('Артем - ', Artem)
    st.write('Света - ', Sveta)
    st.write('-' * 40)
    Egor, Artem, Sveta = "У меня есть скейтборд", \
        "У меня есть велосипед", \
        "У меня есть самокат"
    st.write('Егор - ', Egor)
    st.write('Артем - ', Artem)
    st.write('Света - ', Sveta)
    st.write('🎥 Смотрите мультфильм: песенка про компьютер')

def run_11_2():
    st.markdown('#### 🐍 Урок 11.2. Особенности группового присваивания')
    st.markdown('##### Для объектов разного типа еть особенности распределения памяти')
    st.write('Для неизменяемого объекта')
    c = b = a = 111
    st.write('a ->', a, ', b ->', b, ', c ->', c)
    b = 1
    c = 2
    st.write('a ->', a, ', b ->', b, ', c ->', c)
    st.write('-' * 40)
    st.write('Для изменяемого объекта')
    c = b = a = []
    st.write('a -> ' + str(a) + ', b-> '+ str(b), ', c -> '+ str(c))
    b += [1]
    c += [2]
    st.write('a -> '+ str(a), ', b -> '+ str(b), ', c -> '+ str(c))
    st.write('🎥 Смотрите мультфильм: про безопасность в интернете')

if __name__ == '__main__':
    run_11_1()