# Листинг 15.2
# Создаем список из 15 пассажиров парома
list_passagir = ["Козленок", "Теленок", "Корова",
                 "Бык", "Конь", "Свинья", "Кот",
                 "Пес", "Баран", "Гусь", "Индюк",
                 "Курица", "Волк", "Лиса", "Медведь"]

# Создаем функцию
def poexali(n_1, n_2):
    parom = []  # Пустой паром
    for i in range(n_1, n_2):
        # на паром сел один пассажир
        parom.append(list_passagir[i])
    return parom

print('Утренние рейсы')
print('Рейс 1:', poexali(0, 10))
print('Рейс 2:', poexali(10, 15))
print('Вечерние рейсы')
print('Рейс 3:', poexali(0, 10))
print('Рейс 4:', poexali(10, 15))