# Листинг 8.1
# Множество - коробка
box = {'Машинка', 'Медвежонок', 'Кубик', 'Ракета',
       'Кукла', 'Петрушка'}
# Множество - игрушки на полу 1
pol_1 = {'Солдатик', 'Солдатик', 'Мячик', 'Мячик',
         'Кубик', 'Кубик', 'Бита'}
# Множество - игрушки на полу 2
pol_2 = {'Солдатик-1', 'Солдатик-2', 'Мячик желтый',
         'Мячик красный', 'Кубик большой',
         'Кубик маленький', 'Бита'}
print('Множество коробка ->', box)
print('Множество pol_1 (игрушки на полу) ->', pol_1)
print('Множество pol_2 (игрушки на полу) ->', pol_2)