# Листинг 6.3
# Формируем кортежи
tuple_1 = (1, 2, 3)
tuple_2 = (4, 5, 6)
tuple_3 = ('Хрюша', 'Кирюша', 'Степаша')
# Исходные кортежи
print('Сформированы следующие кортежи:')
print('tuple_1:', tuple_1)
print('tuple_2:', tuple_2)
print('tuple_3:', tuple_3)
print('-' * 30)

# Объединение кортежей
tuple_4 = tuple_1 + tuple_2
print('Объединение кортежей tuple_1 + list_2 ->', tuple_4)

# Объединение кортежей
tuple_1 += tuple_3
print('Объединение кортежей (tuple_1 += tuple_3) ->', tuple_1)

# Объединяем с самим собой 3 раза
tuple_1 = (1, 2, 3)
print('Умножение кортежей (tuple_1*3) ->', tuple_1 * 3)

# Поиск в кортеже
p1 = 'Степаша' in tuple_3
print('Степаша найден->', p1)
p1 = 'Гоша' in tuple_3
print('Гоша найден ->', p1)