# Листинг 5.4
# Формируем списки
list_1 = [1, 2, 3]
list_2 = [4, 5, 6]
list_3 = ['Ниф-Ниф', 'Нуф-Нуф', 'Наф-Наф']
print('Исходные списки:')
print('Список list_1:', list_1)
print('Список list_2:', list_2)
print('Список list_3:', list_3)
print('--------------------------------------')
# Объединение списков
list_4 = list_1 + list_2
print('Объединение списков list_1 + list_2', list_4)

# Объединение списков
list_1 += list_3
print('Объединение списков (list_1 += list_3) ->', list_1)

# Объединяем с самим собой 3 раза
list_1 = [1, 2, 3]
print('Умножение списка (list_1*3) ->', list_1 * 3)

# Поиск в списке
p1 = 'Наф-Наф' in list_3
print('Наф-Наф найден ->', p1)
p1 = 'Кирюша' in list_3
print('Кирюша найден ->', p1)