# Листинг 5.1
# Создаем список пассажиров парома
list_pass = ["Козленок", "Теленок",
                 "Корова", "Бык", "Конь",
                 "Свинья", "Кот", "Пес",
                 "Баран", "Гусь"]
print('Список пассажиров парома.')
print('Пассажир №1 - ', list_pass[0])
print('Пассажир №2 - ', list_pass[1])
print('Пассажир №3 - ', list_pass[2])
print('Пассажир №4 - ', list_pass[3])
print('Пассажир №5 - ', list_pass[4])
print('Пассажир №6 - ', list_pass[5])
print('Пассажир №7 - ', list_pass[6])
print('Пассажир №8 - ', list_pass[7])
print('Пассажир №9 - ', list_pass[8])
print('Пассажир №10 - ', list_pass[9])