# Листинг 1.14
print('Для однострочного комментария используется символ - #')
x = 10  # Это комментарий в строке с кодом программы
# Это комментарий перед строкой с кодом программы
y = 20

print("Для многострочного комментария используется тройной апостроф")
print("Например - '''Это комментарий''' ")
'''
Это многострочный комментарий в тройных апострофах.
Его видит только программист.
При работе программы он не выводится на экран.
'''

print('Или тройные кавычки, например -  """Это комментарий""" ')
"""
Это многострочный комментарий в тройных кавычках.
Его видит только программист.
При работе программы он не выводится на экран.
"""