# Листинг 2.1
a = 100
print('В переменную "а" положили число -', a)

a = 0.25
print('В переменную "а" положили другое число -', a)

a = 'А и Б сидели на трубе'
print('В переменную "а" положили строку -', a)

a = 'А упала Б пропала, что осталось на трубе'
print('В переменную "а" положили другую строку -', a)

a = ['Ниф-Ниф', 'Нуф-Нуф', 'Наф-Наф']
print('В переменную "а" положили список имен поросят -', a)

a = ('Рюша', 'Хрюша', 'Кирюша')
print('В переменную "а" положили кортеж с именами поросят -', a)

a = {'Имя': 'Максим', 'Возраст': 25}
print('В переменную "а" положили словарь -', a)

a = {'Апельсины', 'Мандарины', 'Лимоны'}
print('В переменную "а" положили набор set -', a)

a = True
print('В переменную "а" положили логическую константу -', a)

a = None
print('В переменной "а" пусто -', a)